let S = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22, 23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81];
S[0] = [47,49,51,53,55,57,59,61,63,65];
S[1] = [112,114,116,118,120,122,124,126,128,130];
S[2] = [112,114,116,118,120,122,124,126,128,130];
S[3] = [112,114,116,118,120,122,124,126,128,130];
S[4] = [77,78,79,80,81,82,83,84,85,86];
S[5] = [41,43,45,47,49,51,53,55,57,58,59];
S[6] = [97,99,101,103,105,107,109,111,113,115];
S[7] = [99,101,103,105,107,109,111,113,115,117];
S[8] = [154,156,158,160,162,164,166,168,170,172];
S[9] = [92,94,96,98,100,102,104,106,108,110];
S[10] = [106,108,110,112,114,116,118,120,122,124];
S[11] = [128,130,132,134,136,138,140,142,144,146];
S[12] = [42,44,46,48,50,52,54,56,58,60];
S[13] = [132,134,136,138,140,142,144,146,148,150];
S[14] = [110,112,114,116,118,120,122,124,126,128];
S[15] = [77,79,81,83,85,87,89,91,93,95];
S[16] = [114,116,118,120,122,124,126,128,130,132];
S[17] = [135,137,139,141,143,145,147,149,151,153];
S[18] = [112,114,116,118,120,122,124,126,128,130];
S[19] = [102,104,106,108,110,112,114,116,118,120];
S[20] = [82,84,86,88,90,92,94,96,98,100];
S[21] = [122,124,126,128,130,132,134,136,138,140];
S[22] = [42,44,46,48,50,52,54,56,58,60];
S[23] = [40,42,44,46,48,50,52,54,56,58];
S[24] = [62,64,66,68,70,72,74,76,78,80];
S[25] = [79,81,83,85,87,89,91,93,95,97,99];
S[26] = [72,74,76,78,80,82,84,86,88,90];
S[27] = [67,69,71,73,75,77,79,81,83,85];
S[28] = [72,74,76,78,80,82,84,86,88,90];
S[29] = [131,133,135,137,139,141,143,145,147,149];
S[30] = [93,95,97,99,101,103,105,107,109];
S[31] = [100,102,104,106,108,110,112,114,116,118];
S[32] = [134,136,138,140,142,144,146,148,150,152];
S[33] = [108,110,112,114,116,118,120,122,124,126];
S[34] = [102,104,106,108,110,112,114,116,118,120];
S[35] = [67,69,71,73,75,77,79,81,83,85];
S[36] = [62,64,66,68,70,72,74,76,78,80];
S[37] = [77,79,81,83,85,87,89,91,93,95];
S[38] = [92,94,96,98,100,102,104,106,108,110];
S[39] = [42,44,46,48,50,52,54,56,58,60];
S[40] = [78,80,82,84,86,88,90,92,94,96];
S[41] = [92,94,96,98,100,102,104,106,108,110];
S[42] = [77,79,81,83,85,87,89,91,93,95];
S[43] = [103,105,107,109,111,113,115,117,119,121];
S[44] = [92,94,96,98,100,102,104,106,108,110];
S[45] = [92,94,96,98,100,102,104,106,108,110];
S[46] = [76,78,80,82,84,86,88,90,92,94];
S[47] = [132,134,136,138,140,14,144,146,148,150];
S[48] = [92,94,96,98,100,102,104,106,108,110];
S[49] = [87,89,91,93,95,97,99,101,103,105];
S[50] = [42,44,46,48,50,52,54,56,58,60];
S[51] = [87,89,91,93,95,97,99,101,103,105];
S[52] = [83,85,87,89,91,93,95,97,99,101];
S[53] = [86,88,90,92,94,96,98,100,102,104];
S[54] = [59,61,63,65,67,69,71,73,75,77];
S[55] = [42,44,46,48,50,52,54,56,58,60];
S[56] = [42,44,46,48,50,52,54,56,58,60];
S[57] = [107,109,111,113,115,117,119,121,123,125];
S[58] = [122,124,126,128,130,132,134,136,138,140];
S[59] = [109,111,113,115,117,119,121,123,125,127];
S[60] = [72,74,76,78,80,82,84,86,88,90];
S[61] = [47,49,51,53,55,57,59,61,63,65];
S[62] = [97,99,101,103,105,107,109,111,113,115];
S[63] = [87,89,91,93,95,97,99,101,103,105];
S[64] = [72,74,76,78,80,82,84,86,88,90];
S[65] = [82,84,86,88,90,92,94,96,98,100];
S[66] = [72,74,76,78,80,82,84,86,88,90];
S[67] = [87,89,91,93,95,97,99,101,103,105];
S[68] = [87,89,91,93,95,97,99,101,103,105];
S[69] = [102,104,106,108,110,112,114,116,118,120];
S[70] = [122,124,126,128,130,132,134,136,138,140];
S[71] = [62,64,66,68,70,72,74,76,78,80];
S[72] = [92,94,96,98,100,102,104,106,108,110];
S[73] = [62,64,66,68,70,72,74,76,78,80];
S[74] = [77,79,81,83,85,87,89,91,93,95];
S[75] = [102,104,106,108,110,112,114,116,118,120];
S[76] = [32,34,36,38,40,42,44,46,48,50];
S[77] = [17,19,21,23,25,27,29,31,33,35];
S[78] = [67,69,71,73,75,77,79,81,83,85];
S[79] = [32,34,36,38,40,42,44,46,48,50];
S[80] = [62,64,66,68,70,72,74,76,78,80];
S[81] = [132,134,136,138,140,142,144,146,148,150];
let rotomS = [0,1];
rotomS[0] = [103,105,107,109,111,113,115,117,119,121];
rotomS[1] = [98,100,102,104,106,108,110,112,114,116];
let chaos = 0;
let rotom = [
 {"id": 0, "A": 70, "B": 97, "C": 115, "D": 97, "img1": "../pokemonquestimg/ロトム1.png", "img2": "../pokemonquestimg/ロトム2.png", "img": "../pokemonquestimg/ロトム2.png", "url": "url(../pokemonquestimg/ロトム2.png)", "type": "ゴースト", "color": "#300770", "skill1": 17, "skill2": 32, "skill3": 50, "skill4": 109, "subN": 0},
 {"id": 1, "A": 85, "B": 127, "C": 125, "D": 127, "S": 0, "img1": "../pokemonquestimg/ヒートロトム1.png", "img2": "../pokemonquestimg/ヒートロトム2.png", "img": "../pokemonquestimg/ヒートロトム2.png", "url": "url(../pokemonquestimg/ヒートロトム2.png)", "type": "ほのお", "color": "#FF421C", "skill1": 110, "skill2": 32, "skill3": 17, "skill4": 50, "subN": 1},
 {"id": 2, "A": 85, "B": 127, "C": 125, "D": 127, "S": 0, "img1": "../pokemonquestimg/ウォッシュロトム.png", "img2": "../pokemonquestimg/ウォッシュロトム.png", "img": "../pokemonquestimg/ウォッシュロトム.png", "url": "url(../pokemonquestimg/ウォッシュロトム.png)", "type": "みず", "color": "#028DFF", "skill1": 94, "skill2": 32, "skill3": 17, "skill4": 50, "subN": 1},
 {"id": 3, "A": 85, "B": 127, "C": 125, "D": 127, "S": 0, "img1": "../pokemonquestimg/カットロトム1.png", "img2": "../pokemonquestimg/カットロトム2.png", "img": "../pokemonquestimg/カットロトム1.png", "url": "url(../pokemonquestimg/カットロトム1.png)", "type": "くさ", "color": "#55D600", "skill1": 111, "skill2": 32, "skill3": 17, "skill4": 50, "subN": 1},
 {"id": 4, "A": 85, "B": 127, "C": 125, "D": 127, "S": 0, "img1": "../pokemonquestimg/スピンロトム1.png", "img2": "../pokemonquestimg/スピンロトム2.png", "img": "../pokemonquestimg/スピンロトム2.png", "url": "url(../pokemonquestimg/スピンロトム2.png)", "type": "ひこう", "color": "#ABBFF3", "skill1": 1, "skill2": 32, "skill3": 17, "skill4": 50, "subN": 1},
 {"id": 5, "A": 85, "B": 127, "C": 125, "D": 127, "S": 0, "img1": "../pokemonquestimg/フロストロトム1.png", "img2": "../pokemonquestimg/フロストロトム2.png", "img": "../pokemonquestimg/フロストロトム1.png", "url": "url(../pokemonquestimg/フロストロトム1.png)", "type": "こおり", "color": "#44D3FF", "skill1": 112, "skill2": 32, "skill3": 17, "skill4": 50, "subN": 1},
];
let ivsS = [0,1,2,3,4,5,6,7];
ivsS[0] = [77,79,81,83,85,87,89,91,93,95];
ivsS[1] = [77,79,81,83,85,87,89,91,93,95];
ivsS[2] = [142,144,146,148,150,152,154,156,158,160];
ivsS[3] = [107,109,111,113,115,117,119,121,123,125];
ivsS[4] = [77,79,81,83,85,87,89,91,93,95];
ivsS[5] = [122,124,126,128,130,132,134,136,138,140];
ivsS[6] = [77,79,81,83,85,87,89,91,93,95];
ivsS[7] = [72,74,76,78,80,82,84,86,88,90];

let ivs = [
 {"id": 0, "name": "ブースター", "level": 50, "MHP": 140, "HP": 140, "A": 150, "B": 80, "C": 115, "D": 130, "S": 0, "img1": "../pokemonquestimg/ブースター1.jpg", "img2": "../pokemonquestimg/ブースター2.jpg", "img": "../pokemonquestimg/ブースター2.jpg", "bodytype1": "ほのお", "bodytype2": "null", "skill1": 138, "skill2": 19, "skill3": 3, "skill4": 167, "F": "こんじょう", "heavy": 25, "color1": "#FF421C", "color2": "#FFFFFF", "Fdp": "状態異常のときこうげきが上がる。また、「やけど」状態でもこうげきが下がらない"},
 {"id": 1, "name": "シャワーズ", "level": 50, "MHP": 205, "HP": 205, "A": 85, "B": 80, "C": 130, "D": 115, "S": 0, "img1": "../pokemonquestimg/シャワーズ.png", "img2": "../pokemonquestimg/シャワーズ.png", "img": "../pokemonquestimg/シャワーズ.png", "bodytype1": "みず", "bodytype2": "null", "skill1": 128, "skill2": 68, "skill3": 17, "skill4": 44, "F": "ちょすい", "heavy": 29, "color1": "#028DFF", "color2": "#FFFFFF", "Fdp": "みずタイプの技を受けると、ダメージを受けず回復する"},
 {"id": 2, "name": "サンダース", "level": 50, "MHP": 140, "HP": 140, "A": 85, "B": 80, "C": 130, "D": 115, "S": 0, "img1": "../pokemonquestimg/サンダース1.png", "img2": "../pokemonquestimg/サンダース2.png", "img": "../pokemonquestimg/サンダース2.png", "bodytype1": "でんき", "bodytype2": "null", "skill1": 32, "skill2": 52, "skill3": 17, "skill4": 168, "F": "ちくでん", "heavy": 24, "color1": "#FFE000", "color2": "#FFFFFF", "Fdp": "でんきタイプの技を受けると、ダメージを受けず回復する"},
 {"id": 3, "name": "リーフィア", "level": 50, "MHP": 140, "HP": 140, "A": 130, "B": 150, "C": 80, "D": 85, "S": 0, "img1": "../pokemonquestimg/リーフィア1.png", "img2": "../pokemonquestimg/リーフィア2.png", "img": "../pokemonquestimg/リーフィア2.png", "bodytype1": "くさ", "bodytype2": "null", "skill1": 119, "skill2": 122, "skill3": 169, "skill4": 24, "F": "ようりょくそ", "heavy": 25, "color1": "#55D600", "color2": "#FFFFFF", "Fdp": "天気が「にほんばれ」のとき、すばやさが上がる"},
 {"id": 4, "name": "グレイシア", "level": 50, "MHP": 140, "HP": 140, "A": 80, "B": 130, "C": 150, "D": 115, "S": 0, "img1": "../pokemonquestimg/グレイシア1.jpg", "img2": "../pokemonquestimg/グレイシア2.jpg", "img": "../pokemonquestimg/グレイシア2.jpg", "bodytype1": "こおり", "bodytype2": "null", "skill1": 170, "skill2": 86, "skill3": 156, "skill4": 46, "F": "ゆきがくれ", "heavy": 25, "color1": "44D3FF", "color2": "#FFFFFF", "Fdp": "天気が「ゆき」のとき、回避率が上がる"},
 {"id": 5, "name": "エーフィ", "level": 50, "MHP": 140, "HP": 140, "A": 85, "B": 80, "C": 150, "D": 115, "S": 0, "img1": "../pokemonquestimg/エーフィ1.jpg", "img2": "../pokemonquestimg/エーフィ2.jpg", "img": "../pokemonquestimg/エーフィ2.jpg", "bodytype1": "エスパー", "bodytype2": "null", "skill1": 126, "skill2": 17, "skill3": 171, "skill4": 14, "F": "シンクロ", "heavy": 26, "color1": "#FF8DE8", "color2": "#FFFFFF", "Fdp": "自分がなってしまったどくやまひややけどを相手にうつす"},
 {"id": 6, "name": "ブラッキー", "level": 50, "MHP": 170, "HP": 170, "A": 85, "B": 130, "C": 80, "D": 150, "S": 0, "img1": "../pokemonquestimg/ブラッキー1.jpg", "img2": "../pokemonquestimg/ブラッキー2.jpg", "img": "../pokemonquestimg/ブラッキー1.jpg", "bodytype1": "あく", "bodytype2": "null", "skill1": 172, "skill2": 173, "skill3": 174, "skill4": 82, "F": "せいしんりょく", "heavy": 27, "color1": "#452222", "color2": "#FFFFFF", "Fdp": "ひるみ状態にならない。また、相手のいかくの効果を受けない"},
 {"id": 7, "name": "ニンフィア", "level": 50, "MHP": 170, "HP": 170, "A": 85, "B": 85, "C": 130, "D": 150, "S": 0, "img1": "../pokemonquestimg/ニンフィア1.jpg", "img2": "../pokemonquestimg/ニンフィア2.jpg", "img": "../pokemonquestimg/ニンフィア1.jpg", "bodytype1": "フェアリー", "bodytype2": "null", "skill1": 52, "skill2": 53, "skill3": 17, "skill4": 46, "F": "フェアリースキン", "heavy": 23, "color1": "#FF58B9", "color2": "#FFFFFF", "Fdp": "ノーマルタイプの技がフェアリータイプになる"},
];
let BOSS = [
 { "name": "ムゲンダイナ", "level": 50, "MHP": 330, "HP": 330, "A": 135, "B": 270, "C": 145, "D": 270, "S": 150, "img": "Mugendina(mugendynamax).png", "bodytype1": "どく", "bodytype2": "ドラゴン", "skill1": 16, "skill2": 3, "skill3": 10, "skill4": 8, "power1": 130, "power2": 120, "power3": 130, "power4": 130, "type1": "special", "type2": "physics", "type3": "special", "type4": "special", "F": "プレッシャー", "heavy": 950, "color1": "#A600FF", "color2": "#4954A9", "MAX": true},
 { "name": "ネクロズマ", "level": 50, "MHP": 172, "HP": 172, "A": 187, "B": 117, "C": 187, "D": 117, "S": 149, "img": "UltraNecrozma.png", "bodytype1": "エスパー", "bodytype2": "ドラゴン", "skill1": 183, "skill2": 55, "skill3": 171, "skill4": 184, "F": "ブレインフォース", "heavy": 230, "color1": "#FF8DE8", "color2": "#4954A9"},
];